# ==大数据管理==

---

## 第一章：大数据管理系统概述

### 大数据管理发展历史

层次、网状数据库——关系数据库——非结构化数据管理

### ==大数据管理系统的特征==

#### 数据特征

-   大容量、多类型、变化快、质量弱

#### 系统特征

-   数据来源：从封闭世界到开放世界，从结构化数据到非结构化数据。数据库需要支持不同数据类型，处理数据无模式
-   数据质量：从精确到不精确，变成量质融合管理
-   从数据管理到知识管理

#### 应用特征

-   以对象为中心进行数据组织，实现数据汇聚
-   以机器学习为主要应用类型
-   以社会发展第四范式“数据驱动”为解决问题新模式

#### 典型组成特征

-   多引擎数据结构：同一数据库中支持多数据模型，并提供统一对外接口
-   混合负载系统架构：实现不同计算模式（流计算、批计算等）
-   分布式系统结构：实现分布式容错机制、高可伸缩性和高可用性

#### 典型技术的分层架构——自底向上

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113101047426.png" alt="image-20231113101047426" style="zoom:50%;" />

-   分布式文件系统
-   分布式缓冲区管理
-   存储管理
-   计算引擎
-   查询引擎
-   原生应用
-   资源管理与调度

### 解决多类型数据的思路

#### 混合持久化：根据不同数据需求选择合适的数据库

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113101243917.png" alt="image-20231113101243917" style="zoom:33%;" />

#### 多摸数据库引擎：同一数据库中使用多种数据库引擎

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113101344677.png" alt="image-20231113101344677" style="zoom:33%;" />

## [第二章：关系数据模型与SQL]()

#### ==2023.8.30==

### 一份CheatSheet复习SQL

[*SQL-Cheatsheet*](./doc/sql-for-data-analysis-cheat-sheet-a4.pdf)

### ==SQL for xml：==

[*参考及案例*](https://www.codeproject.com/Articles/1189725/FOR-XML-Basics-EXPLICIT-Mode-of)

**raw和auto共同点：**返回的都是XML元素，列值作为返回值的属性

**raw：**将查询结果直接返回，每行是一个元素，列值作为元素的属性，元素名称自定义

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113102443287.png" alt="image-20231113102443287" style="zoom:33%;" />

**auto：**以表名为名称的元素，当结果有部分相同时，auto可以形成简单的层次关系，以表名为节点，从左至右形成父子关系的嵌套结构。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113102627585.png" alt="image-20231113102627585" style="zoom:50%;" />

**explicit：**通过定义XML格式的别名形成层次结构，相同Tag的为一组

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113103753348.png" alt="image-20231113103753348" style="zoom:33%;" />

**path：**将列名或列别名作为XPATH表达式处理，形成层次结构

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113102844117.png" alt="image-20231113102844117" style="zoom:33%;" />

### SQL for JSON：

-   读取JSON文件
-   建表并查询
-   写入JSON文件

#### MySQL for JSON：

-   同上

### SQL on Hadoop

#### 类型

-   outside hadoop：SQL通过连接器访问Hadoop数据

-   alongside hadoop：修改SQL引擎实现和Mapreduce的混合负载
-   on hadoop：通过类SQL语言实现MapReduce或者SQL直接内嵌hadoop框架
-   in hadopp：实现Hadoop中的数据库

#### ==HiveQL：==

**Mapreduce结构：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/main-qimg-5e8f78e1b96af195d428640470c7952e-lq.jpeg" alt="What are the different types of input format in mapreduce? - Quora" style="zoom: 67%;" />

**一、和Mapreduce结合，通过语句获得处理能力：**

-   group by：与SQL类似

-   distribute by：分区，类似于Mapreduce中的partition，结合sort使用，
-   sort by：每个分区内部排序
-   order by： 全局排序，相当于reduce
-   cluster by：当distribute by和sort by字段相同时可以使用，兼具二者功能

**二、MapReduce嵌入：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113110005569.png" alt="image-20231113110005569" style="zoom:33%;" />

#### SQL中应用机器学习

-   定义生成模型的过程
-   创建存储模型参数的关系表
-   生成实际模型，将训练结果存储在关系表中
-   加载模型参数，调用模型

### NoSQL

#### 特点：

-   无模式设计：用户可以自定义数据存储格式并随时修改
-   弱一致性：采用最终一致性配合多副本
-   易扩展性：使用分布式存储
-   高并发读写性能：弱化ACID

#### 瓶颈：

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113110733362.png" alt="image-20231113110733362" style="zoom:33%;" />

#### NoSQL数据库类型及分析

**键值数据库：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113111343703.png" alt="image-20231113111343703" style="zoom:33%;" />

**列族数据库：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113111412110.png" alt="image-20231113111412110" style="zoom:33%;" />

**文档数据库：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113111436608.png" alt="image-20231113111436608" style="zoom:33%;" />

**图数据库：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113111453148.png" alt="image-20231113111453148" style="zoom:33%;" />

**BASE模型 vs ACID模型**

#### TimesTen

-   数据全部在内存，不需要从硬盘上取数据；

-   应用和Timesten可以在同一台机器上直接访问，无需经过网络TCP/IP。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113112325563.png" alt="image-20231113112325563" style="zoom:50%;" />

#### Oracle Database in Memory

**双举负载：**它支持同时以现有的 Oracle 行格式缓存（适用于 OLTP 操作）和新的纯 In-Memory 列格式（为分析处理OLAP而优化）维护数据。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113112505579.png" alt="image-20231113112505579" style="zoom:33%;" />

### 数据库演化趋势

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113112718685.png" alt="image-20231113112718685" style="zoom:33%;" />

## [第三章：键值对数据模型]()

#### ==2023.9.25==
#### ==2023.11.13==

### 数据模型

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113115206751.png" alt="image-20231113115206751" style="zoom:33%;" />

#### 键值对数据模型

-   灵活的无模式表达
-   可扩展、高性能的数据查询
    -   数据冗余，数据异常处理
    -   减少多表连接
-   一一映射

### Memcached：分布式高速缓存系统

#### 原理：通过缓存数据库查询，减少RDBMS的访问次数

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20230925104954415.png" alt="image-20230925104954415" style="zoom:30%;" />

#### 数据模型：

**数据结构：**HashMap表

**数据操作：**

-   查询：通过get_key函数获得值。

#### MemCache 优化

**缺点：**

- 容易产生内存碎片（malloc free 的频繁调用）
- 内存管理开销大

**改进**

- **Slab Allocator**：池化内存管理
- chunk：相同长度的内存快
- slab：许多chunks组成的组

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20230925105127094.png" alt="image-20230925105127094" style="zoom:30%;" />

**新问题：**无法充分利用chunk内存

#### 数据传输：

使用二进制协议减少性能开销，包为24字节的帧

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113120451827.png" alt="image-20231113120451827" style="zoom:33%;" />

#### ==分布式缓存：==

根据算法计算保存‘rname’键的节点，通过算法定位数据（不使用寻址表）

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20230925105619923.png" alt="image-20230925105619923" style="zoom:45%;" />

**早期：**

-   哈希值求余得到存储该数据的服务器节点
-   如果分配失败，当前服务器值+1再哈希得到节点位置

**一致hash：**

-   计算每台服务器的节点hash并放置（0～$2^{32}$-1）
-   计算每个键的节点hash并放置
-   每个键顺时针寻找离自己最近的服务器并缓存（找不到则保存到第一台上）

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20230925112639872.png" alt="image-20230925112639872" style="zoom:30%;" />

**问题：**

-   每台服务器有可能负载不均衡
-   当一台服务器失效之后需要重新分布

**优化：引入虚拟节点**

为每个节点分配100-200个虚拟节点作为虚拟节点。

### Dynamo

#### 特征

-   最终一致性
-   永远可写

-   对称性和去中心化

- 多版本读写：指定不同的NRW值
- Gossip同步
- 完全分布式

#### 架构

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113140220193.png" alt="image-20231113140220193" style="zoom:30%;" />

#### 数据模型

-   数据组织：key-value，节点，实例（一组节点组成）
-   数据结构：表——数据项——属性，每个数据项可以不同，拥有主键
-   数据类型：标量、复杂类型、集合类型

#### ==数据分布：一致性hash==

**改进虚拟节点：**固定所有虚拟节点的大小和位置，改变虚拟节点和物理节点的映射关系。

-   新节点加入/离开：平均分配

#### 读写过程

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113141054381.png" alt="image-20231113141054381" style="zoom:33%;" />

#### NRW协议：R+W>N

#### ==逻辑时钟==：在分布式系统中为所有事件定义全局顺序

1.   每个节点本地维护$Lc_i$
2.   每个节点本地发生事件时$Lc_i = Lc_i + 1$
3.   节点 i 给 j 发信息时将$Lc_i$存储在消息中
4.   节点 j 判断$LC_j =max(Lc_j, m\_timestamp)+1$，作为收到m消息的时间戳

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113142841093.png" alt="image-20231113142841093" style="zoom:50%;" />

#### ==Vector Clock==：逻辑时钟的向量

$VC_i[i]$代表目前i本地发生事件的个数，$VC_i[k]$代表i认为k节点发生事件的个数

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113144152899.png" alt="image-20231113144152899" style="zoom:50%;" />

**更新算法：**

1.   本地发生事件,$VC_i[i] + 1$
2.   j收到i发来的消息时，$VC_j[k] = max(VC_j[k], VC_i[k])$，同步其他节点
3.   $VC_j[j] + 1$

采用服务器向量标示向量空间

**问题：网络延迟丢失数据**

**优化：向量剪枝**

-   向量时钟的长度和时间戳大于某些值会发生剪枝
-   问题：保存很久的向量信息被简直导致无法找到祖先
-   仍然是一个很好的方案

### Redis

#### 特点：

-   内存数据库
-   key-value数据库
-   存储数据持久化（内存、磁盘、log文件存储）
-   不同节点之间备份

#### ==数据模型：redisObject==

-   数据类型
-   编码方式
-   数据指针
-   虚拟内存
-   其他

**String类型：**字符串内可以包含任何对象或者数据

**Hash类型：**其值本身是一个hashmap，通过key+field才能操作对应属性数据。使用哈希结构的中域作为二级索引查找信息更加灵活方便。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114165216743.png" alt="image-20231114165216743" style="zoom:33%;" />

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231115083330958.png" alt="image-20231115083330958" style="zoom:33%;" />

**LinkList类型：**双向链表，常用命令为lpush/rpush/lpop/rpop/lrange

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231115083435003.png" alt="image-20231115083435003" style="zoom:40%;" />

**Set类型：**value 为 null 的Hashmap

==**Ordered Set类型：**==实现上使用HashMap和SkipList（$O(log n)$）表征数据存储有序。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113145306549.png" alt="image-20231113145306549" style="zoom:40%;" />

#### ==SkipList==

[CMU-course](https://www.cs.cmu.edu/~ckingsf/bioinfo-lectures/skiplists.pdf)

**特征：**

1.   一个跳表由多个层（level）组成；

2.   每一层都是一个有序的链表；

3.   第0层包含所有的元素；
4.   如果元素x出现在第i层，则所有比i小的层都包含x；
5.   第i层的元素通过level数组指向下一层拥有相同值的元素；
6.   在每一层中都包含-1和Infinite两个元素，分别表示INT_MIN和INT_MAX；
7.   Top指针指向最高层的第一个元素。

**伪代码：插入、删除、查找**

```cpp
//find k
初始化指针p指向top
if（p.value < key）go down next level;
else if(p.value > key) go right;
else if(p.value == key) done!

//insert k
查找每层待插入的位置
随机生成一个层数
从上向下插入，则新建节点插入上一层的链表中

//delete k
find k
if（isnot at level 0）	{
  find next level k
  delete k
  p -> next level k
}
```

#### 内存管理：

Redis为了方便内存的管理，在分配一块内存之后，会将 这块内存的大小存入内存块的头部。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231115084852364.png" alt="image-20231115084852364" style="zoom:33%;" />

#### 内存持久化：

**RDB快照：**通过子进程循环所有数据生成RDB文件

**AOF日志：**写入Redis标准命令，通过rewrite减少文件数量

#### 主从结构：

**改进**

-   sentinel：使用哨兵进行消息的监控
-   proxy：添加代理服务器
-   cluster

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113152622581.png" alt="image-20231113152622581" style="zoom:45%;" />

#### 集群架构

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113152709470.png" alt="image-20231113152709470" style="zoom:50%;" />

### RAMCloud

#### 架构：storage server 和 Coordinator（管理者）

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20230927114132447.png" alt="image-20230927114132447" style="zoom:33%;" />

#### 数据模型

**数据结构：**数据项和表，其中表可以跨节点存储，形成子表（Tablet）

**数据组织：**通过协调器记录子表和存储服务器的映射关系，并缓存一份到客户端中。

**日志组织：LSM Tree**核心数据在**日志**中，包括元数据、摘要、墓碑

#### LSM Tree

#### 数据服务

#### 资源回收

#### 恢复策略

### BigTable

#### 数据格式：

三维map，行、列、时间戳

#### 数据模型：

行区间动态划分

#### SST Table



## [第四章：文档模型与查询语言](./doc/大数据管理ppt/第4章 文档模型与查询语言.pptx)

#### ==2023.9.7==

#### ==2023.11.13==

### 文档结构

#### ==XML结构：==

- DTD：DTD 是一套关于标记符的语法规则,是XML的类型定义

    ```xml-dtd
    <!ELEMENT note (to,from,heading,body)>
    <!ELEMENT to (#PCDATA)>
    <!ELEMENT from (#PCDATA)>
    <!ELEMENT heading (#PCDATA)>
    <!ELEMENT body (#PCDATA)>
    ```

- XSL：XSL 之于 XML ，就像 CSS 之于 HTML

- XSLT：XSLT用于将一种XML文档转换为另外一种XML文档，或者可被浏览器识别的其他类型的文档，比如HTML和XHTML。

- XLL：是 XML 链接语言，它提供了 XML 中的链接

- XSD：XML文档的结构定义

    *from Website*
    
    **XML结构图：**

<img src="./assets/image-20230906223302004.png" alt="image-20230906223302004" style="zoom: 50%;" />

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113160858417.png" alt="image-20231113160858417" style="zoom:50%;" />

#### JSON结构：示例

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113161648491.png" alt="image-20231113161648491" style="zoom:33%;" />

### 文档查询

#### DOM接口

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113161808551.png" alt="image-20231113161808551" style="zoom:33%;" />

#### XQuery

#### ==FLOWR：==

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113162250666.png" alt="image-20231113162250666" style="zoom:33%;" />

**查询示例：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113162957784.png" alt="image-20231113162957784" style="zoom:33%;" />

#### XPath：示例

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113163050578.png" alt="image-20231113163050578" style="zoom:33%;" />

**tips：**

1.   @id 代表这是User自身的属性而不是下一层的属性与值
2.   // 代表递归寻找

#### JSON API通过JSON 字符串创造对象

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113163422091.png" alt="image-20231113163422091" style="zoom:33%;" />

#### eXistDB：XML数据库

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/xist_0405-20231113163741264.png" alt="4. Architecture - eXist [Book]" style="zoom:50%;" />

### ==MongoDB==

#### 特点

1.   [MongoDB-CheatSheet](https://www.mongodb.com/developer/products/mongodb/cheat-sheet/)
2.   不限制数据模式结构

#### 系统架构

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113164515363.png" alt="image-20231113164515363" style="zoom:33%;" />

#### 数据模型

**数据类型：**Binary Json

**数据组织：**和关系数据库类似

| **SQL术语/概念** | **MongoDB术语/概念** | **解释/说明**                |
| :----------------------: | :------------------------------: | :----------------------------------: |
| database                 | database                         | 数据库                               |
| table                    | collection                       | 数据库表/集合                        |
| row                      | document                         | 数据记录行/文档                      |
| column                   | field                            | 数据字段/域                          |
| index                    | index                            | 索引                                 |
| table joins              |                                  | 表连接，MongoDB不支持                |
| primary key              | primary key                      | 主键，MongoDB自动将_id字段设置为主键 |

#### 数据操作：

**CRUD操作（增删改查）**

```js
db.dropdatebase()

use Husting
// create/remove collections
db.createCollection('Hust')
db.Hust.drop()
// in db Hust
//insert
db.Hust.insert({"id":1,"name":"cs"})
db.Hust.insertMany([...])
//delete
db.Hust.remove({"name":"cs"})
//update
db.Hust.update({"name":"cs"},$set:{"id":2})
//find
db.Hust.find({"id":2})
  .limit(10)
  .skip(2)
	.sort({"id":1/-1})

//find examples
//1.find and project
db.tb_students.find({"age":12}, {"student_id":1,"name":1,"age":1})
//2.some function
db.tb_user.find({'user_id':{$lt:3}})
//3.using and && or
db.tb_user.find(  
   {'password':1234567}, 
     $or:[{'user_id':{$lt:7}},{'user_id':{$gte:10}}] 
   })
   
//build index
db.Hust.ensureIndex({"id":1})
db.Hust.createIndex({"id":1})

//other useful function
$in
$or
$lt
$gt
$ne
.aggregate([
    {$match},
    {$group...$count},
    {$project},
		{$sort},
  ])
//using regex to find 
find("name":{$regex":/a,$options:"x/i/s/m"})
     
//aggregate examples
//1.
db.event.aggregate([ 
{$group: {"_id": "$event_id", count: {$sum: 1}}}, 
{$project: {"_id": 0, "event_id": "$_id", "count": 1}}, 
{$sort: {"count": -1}}     ]) 
//2.
db.book_info.aggregate( {"$project":{"title":1,"vote_num":1}},
      {"$group":{"_id":"$title","vote_num":{"$sum":"$vote_num"}}},
      {"$sort":{"vote_num":-1}},
      {"$limit":5})
```

## [第五章：第5章 图模型与类SQL查询语言](./doc/大数据管理ppt/第5章 图模型与类SQL查询语言4.0版本V2.pptx)

### ==图数据结构==

#### 简单图：二元组（V，E）

#### 标签图：三元组（V，L，E）

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113171242509.png" alt="image-20231113171242509" style="zoom:50%;" />



**资源描述框架RDF：**陈述三元组<资源，属性，属性值>“主语+谓语+宾语”

-   **资源：**被RDF描述的内容

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113172335612.png" alt="image-20231113172335612" style="zoom:33%;" />

**改进：RDF的谓词空间很小**

-   RDFS：增加一些谓词
-   OWL：RDF的扩充，计算逻辑为基础，做知识显性化，验证知识一致性

#### ==属性图：四元组（V，L，E，A）==

1.   V：一组顶点的集合
2.   L：一组标签的集合
3.   E：一组边的集合
4.   A：属性集合

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113210722756.png" alt="image-20231113210722756" style="zoom:33%;" />

**作答总结：**

1.   V，L，E，A
2.   N1.L，N1.A, E1.L,E1.A
3.   N1[L] = …,E1[A] = …

#### 知识图谱

-   模式层
-   数据层

### 图操作

#### 图匹配

**子图同构**

1.   在target和query图中分别选择一个节点形成原子对
2.   判断该原子对能否匹配，如果匹配则加入状态

3.   重复第一步，一般选择上次选择节点的相邻节点

4.   当query中没有节点时完成匹配

**VF2算法**

-   剪枝：当原子对中query节点的度大于target时，剪枝该节点

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20230918112905813.png" alt="image-20230918112905813" style="zoom:33%;" />

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114233439820.png" alt="image-20231114233439820" style="zoom:33%;" />

-   支配与skyline
    -   为图数据画出边框线，用line上的点近似支配一片区域的图数据，研究其他的点

**超大规模索引**

**查询图分解**：

先切成子图碎片，然后再拼接join（确保问题等价）

#### 图导航：按照某种规则查询图中的一个序列

### 面向图数据的类SQL查询语言

#### SPARQL

搜索的目标是主语或者宾语，提供资源的RDF表述，比如：

```sql
//basic usage
SELECT ?album ？artist
{
   ?album a  :Album .
   ?album  :artist  ?artist .
}
```

**基本语法：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113213022669.png" alt="image-20231113213022669" style="zoom:40%;" />

#### ==Cypher==

**特点：**声明式语言、使用模式匹配和正则表达式匹配

**常见命令：**作用域为属性图

| **序号** | **命令** |        **说明**        |
| :------: | :------: | :--------------------: |
|    1     |  CREATE  |   创建顶点、边和属性   |
|    2     |  MATCH   | 检索相关顶点、边和属性 |
|    3     |  RETURN  |      返回查询结果      |
|    4     |  WHERE   | 提供条件，过滤检索数据 |
|    5     |  REMOVE  |   删除顶点和边的属性   |
|    6     |   SET    |     添加或更新标签     |

```sql
//create new vertice 
CREATE (n1:director:filmer{name:'XingchiZhou',gender:'men'})

//create edge
CREATE(n1)-[rname:<labelname>]->(n2)

//find vertice
MATCH(n:movie)
WHERE n.name='XingchiZhou'
RETURN n LIMIT 10

// match the graph examples
//1.
MATCH (t:Person {姓名：'吴孟达'})-[:出演]->(m1)<-[:出演]-(coActors),
             (coActors)-[:出演]->(m2)<-[:出演]-(co_co_Actors)
//排除演员t的直接共同演出演员
WHERE NOT (t)-[:出演]->()<-[:出演]-(co_co_Actors) 
AND t<>co_co_Actors//排除t本人
RETURN co_co_Actors.姓名

//2.
MATCH (t:Person{name:"XingchiZHou"})-[:film]->(m1:Film)<-[:act]-[Actors]
WHERE t<>Actors
Return Actors.name

//3.using regex
MATCH(n:actor)
WHERE n.name =~ ‘Tom.*’
RETURN n

//4.自导自演的演员列表
MATCH (n1)-[:导演]->(n2:电影)
MATCH (n1)-[:出演]->(n2:电影)
RETURN n1.姓名, n2.名称

//5.例：列出一组用户（5、2、3）的id，遍历图查找这些用户指向的friend，并筛选保留name是以S开头的friends，返回用户、friend的name属性。
MATCH (user) WHERE id(user) IN [5,2,3] 
MATCH user-[:friend]->follower
WHERE follower.name =~‘S.*’
RETURN user, follower.name

//6.例：与冯小刚有过合作演出，且与吴孟达也有过合作演出的演员
MATCH (n1:人 {姓名：’冯小刚’})-[:出演]->(电影)<-[:出演]-(n2),
             (n3:人 {姓名：’吴孟达’})-[:出演]->(电影)<-[:出演]-(n2),
RETURN n2.姓名


//acquire the path
//例：判断定点3到2或者4之间是否存在边标签为KNOWS且长度不超过3的路径，如果存在则返回相应路径的起点和终点。
MATCH (a) WHERE id(a) = 3
MATCH (x) WHERE id(x) IN [2,4]
MATCH a-[:KNOWS*1..3]->x
RETURN a, x

//optinal match
//例：返回电影The Matrix这个节点的外向关系。
MATCH (a:Movie { title: 'The Matrix' })
OPTIONAL MATCH (a)-->(x)
RETURN x

//shortest path
MATCH (s) WHERE id(s) = 1    
MATCH (e) WHERE id(e) = 2    //4.0版本放弃START
MATCH p = shortestPath( (s)-[*..15]->(e))
MATCH p = allShortestPaths( s-[*..15]->e )
RETURN p

//Aggregation
MATCH (n) WHERE id(n) IN [2,3,4]
       RETURN avg(n.property) ，max(n.property)，min(n.property),collect(n.property)
       
//With impression
//例：对聚集结果保留计数值大于1的
MATCH (david { name: "David" })--(otherPerson)-->() 
WITH otherPerson, count(*) AS foaf 
WHERE foaf > 1 
RETURN otherPerson
//例：在路径搜索的时候限制分支数。从”Anders”出发，找到关联（无向）的所有人的集合m，保留集合中按照姓名降序排列的第一个顶点，返回该顶点关联（无向）的所有人的name。
MATCH (n { name: "Anders" })--(m) 
WITH m 
ORDER BY m.name DESC LIMIT 1 
MATCH (m)--(o) 
RETURN o.name
COLLECT(distinct n.name)


//update, find out two vertices first and then add the edge between them
//例：添加周星驰导演了电影功夫这一事实（关系）
MATCH (n1:演员：导演 {姓名：’周星驰’})
MATCH (n2:电影{名称:功夫})
CREATE (n1)-[E1:导演]-> (n2)

//DETECH to delete both vertices and edges
MATCH (n:演员:导演{姓名:’张三’})
       DETECH DELETE n

//add/remove tags(n)
//例：将上述例子中顶点的所有原属性删除，并添加新属性(加花括弧表示重置属性定义)
MATCH (n:导演:演员{姓名：‘张三’})
SET n={国籍=‘中国’,出生年月=‘1962-6-22’}
```

#### Gremlin

#### Neo4j:使用Cypher引擎的图数据库

### 图计算模型

#### BSP模型

**superstep：**用于计算，分为三步

1.   根据消息和数据进行本地计算
2.   计算完毕后向其他节点传递消息
3.   整体同步后进入下一次superstep

**架构：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113221539774.png" alt="image-20231113221539774" style="zoom:40%;" />

**分布式处理：**

1.   master 将图分区并分配给worker
2.   worker 为每一个分区开启一个进程，对active的分区完成计算并向其他节点传递消息
3.   同步完成后，重复2操作直到临界条件

**代码模版：**

```cpp
void Compute(MessageIterator *msgs){
	//遍历所有由顶点传入边的消息列表
	for(;!msgs->Done();msgs->Next()){
    //进行计算
		doSomething();
    ...
  }
  //生成新的顶点值
  *MutableVertexValue() = ...
  //沿顶点出边传递消息
  SendMessagetoAllNeighbors(...);
}

//用于整体同步，确定所有的计算和消息传递都进行完毕后，进入下一个superstep
void toNextSuperstep()
```

#### GAS模型：Gather，Apply and Scatter

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113222534784.png" alt="image-20231113222534784" style="zoom:40%;" />

1.   Gather：收集各个节点的数据并求和。顶点和边只读。
2.   Apply：更新master节点。工作顶点可写，边可读
3.   Scatter：更新边。边可写，顶点可读

```cpp
//二跳邻居点查询
init Neighbor matrix;//存储每个节点的邻居
Message gather(int iterNum, Vertex u, Edge e){
  Message msg = receiveMessageFromOtherVertexs(...);
  return msg；
}
//整合所有获得的message
Message sum(Message left, Message right){
  return left + right;
}
void apply(Vertex u, Message sum){
  //u节点更新自己即将发出去的消息内容为收到的邻居id消息及其生命值
  u.value = sum;
}
void scatter(Vertex u,Edge uv, Vertex v){
  uv.value; //保持不变
  SendMessagetoNeighbor(lifetime--);
}

Job(){
  init lifetime = 2;
  execute first run of GAS;
  execute sencond run of GAS;
  Return 每个节点收到生命值为0的消息列表;
}
```

## [第六章：大数据管理系统的体系结构]()

### 体系结构发展

#### ==集中式体系架构==

**优点：**结构简单、数据易于维护、共享性好

**缺点：**可靠性差、主机负担重

**==并行方式==**

-   粗粒度并行：使用多个处理器，增加整体吞吐量

-   细粒度并行：同一个事物使用多个处理器线程，减少每个事务处理时间


**并行加速比：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231115080455654.png" alt="image-20231115080455654" style="zoom:33%;" />

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231115093731293.png" alt="image-20231115093731293" style="zoom:33%;" />

#### Client-Server架构

**优点：**负载均衡、前后端分离

**缺点：**DB访问瓶颈、服务器负担重

#### 并行与分布式体系架构

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113225546120.png" alt="image-20231113225546120" style="zoom:50%;" />

**优点：**事务自治、高可用性、负载均衡

**缺点：**结构复杂难以维护、效率受网络影响

**架构类型：**

-   共享内存型：通信效率高，但对总线带宽有要求
-   共享磁盘型：高并发访问数据，磁盘和处理器之间数据移动的瓶颈
-   无共享

#### 数据库系统体系架构

**事务型服务器：**

**数据型服务器：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113230356709.png" alt="image-20231113230356709" style="zoom:33%;" />

### 并行数据库体系

#### 并行数据库体系架构设计

#### IO并行

**循环划分：**顺序、均匀分布在所有磁盘；适合全范围

**散列划分：**通过散列函数映射磁盘编号，避免使用索引；适合点查询

**范围划分：**按照属性值的范围，会出现数据倾斜

#### 查询并行（查询间与查询内）

**查询间并行：**单个事物响应时间不变，增加吞吐量；引入共享锁和独占锁

**查询内并行：**并行执行独立的操作减少响应时间

#### 操作并行（操作间与操作内）

#### ==操作间并行==

**流水线并行：**前一步的输出是后一步的输入，可以并行计算；各步骤运行时间不均，加速效果有限

**独立并行：** R1 U R2 U R3 U R4 变成R12，R34并行执行，再统一合并

#### 操作内并行：基于关系的不同子集并行处理同一操作

将数据分区并行

**排序操作：**处理不同磁盘，分别进行排序，再汇总

**并行连接操作：**

**划分连接：**将待处理数据划分成独立的n份交给n个不同处理器

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113232316365.png" alt="image-20231113232316365" style="zoom:40%;" />

**分片-复制连接：**R，S按不同方式分片，处理器处理两个分片的连接，可以处理复杂的连接操作

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113232610699.png" alt="image-20231113232610699" style="zoom:40%;" />

**==基于划分的散列并行连接：==**三个阶段

1.   partition：将R表数据划分到不同分区上
2.   build：构建hash表
3.   probe：将S表数据映射到分区上，进行连接操作

-   **不阻塞分区：**一边扫描分区一边进行build构建hash表，仅需扫描一次
-   **阻塞分区（Radix Hash Join）：**partition结束后再进行build，需要扫描多次R表
    -   扫描R并计算每个哈希键的元组数量的直方图在某个偏移量处的基数。
    -   使用此直方图通过计算前缀和来确定输出偏移量。
    -   再次扫描R并根据散列键进行分区。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113233106704.png" alt="image-20231113233106704" style="zoom:50%;" />

### 分布式数据库体系

#### 概述

-   逻辑整体性
-   站点自治性
-   全局一致性

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113233918496.png" alt="image-20231113233918496" style="zoom:40%;" />

**数据分配准则：**

1.   处理局部性
2.   可用性和可靠性
3.   负载均衡

#### ==系统结构模式==

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113234454121.png" alt="image-20231113234454121" style="zoom:40%;" />

-   **全局外模式：**应用程序接触

-   **全局概念模式：**全局外模式（通过映像匹配）

-   **数据分片：**对全局概念模式中的全局关系划分为逻辑片段，即“子关系”

-   **数据分配：**以一定冗余度将子关系分片分配到多个结点中

-   **局部概念模式：**分配到各个节点的数据分片

-   **局部内模式：**局部概念模式在节点内部的存储模式

==**分布式数据库映像**：==

-   全局外模式——全局概念模式
-   全局概念模式——分片模式
-   分片模式——分配模式
-   分配模式——局部概念模式
-   局部概念模式——局部内模式

==**数据独立性：**==

-   逻辑数据独立性
-   分片透明性
-   分配位置透明性
-   局部数据模型透明性
-   物理数据独立性

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231113234222954.png" alt="image-20231113234222954" style="zoom:50%;" />

#### 分布式事务系统结构

**局部事务：**访问、更新局部某个数据库就能完成的事物

**全局事务：**访问、更新多个数据库才能完成的事务

**事务管理器：**节点内局部事务

**事务协调器：**协调全局事务

#### 并发控制

#### 设计方案（举例）

#### 异构和基于云

#### 分布式目录系统

### 大数据管理体系架构

#### NoSQL

#### ==MapReduce==

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114000119737.png" alt="image-20231114000119737" style="zoom:40%;" />

**伪代码：**

```cpp
  SELECT age, AVG(contacts)
    FROM social.person
GROUP BY age
ORDER BY age
    
function Map is
    input: integer K1 between 1 and 1100, representing a batch of 1 million social.person records
    for each social.person record in the K1 batch do
        let Y be the person's age
        let N be the number of contacts the person has
        produce one output record (Y,(N,1))
    repeat
end function

function Reduce is
    input: age (in years) Y
    for each input record (Y,(N,C)) do
        Accumulate in S the sum of N*C
        Accumulate in Cnew the sum of C
    repeat
    let A be S/Cnew
    produce one output record (Y,(A,Cnew))
end function
```

#### Greenpulm

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231018103500932.png" alt="image-20231018103500932" style="zoom:30%;" />



一个master节点和多个segment节点，master负责调度每个segment实例数据库的负载，不同segment 数据库通过interconnect进行通讯。

#### Yarn

#### HAWQ：Greenplum+HDFS

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231018105412195.png" alt="image-20231018105412195" style="zoom:30%;" />

#### SpannerDB

#### GFS

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231018112558177.png" alt="image-20231018112558177" style="zoom:40%;" />

master节点维护所有文件系统的元数据，通过HeartBeat维持chunkServer的通信

#### TFS（taobao）

#### Big Table

#### OceanBase

## [第七章：数据组织与存储]()

### 概述

### 硬件访问模型

### 索引技术

### 键值存储

### 列存储

### 其他存储

## [第八章：分布式查询处理优化]()

### 概述

#### ==分布式查询处理层次：==

-   查询分解

-   数据局部化
-   全局查询优化
-   分布式执行

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114150807384.png" alt="image-20231114150807384" style="zoom:40%;" />

### 数据分布策略

-   **物理存储：**大规模数据的可扩展存储
-   **数据可靠性：**数据复制实现多副本
-   **系统实现：**使用分布式文件系统

#### 分片与复制分配

#### ==TPC-H数据库：==

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114145027907.png" alt="image-20231114145027907" style="zoom:40%;" />

-   全复制
-   非复制
-   部分复制

### 面向关系数据的分布式查询处理

#### ==分片策略：==

#### 水平分片：（根据元组来划分关系，每一个数据片段是关系元组的一个子集）

**特征：**完备性、不相交性

**基本水平分片：**按照某些属性的某些值进行分片

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114145624134.png" alt="image-20231114145624134" style="zoom:33%;" />



**导出式水平分片：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114145807666.png" alt="image-20231114145807666" style="zoom:40%;" />

#### 参照分片

#### 垂直分片：（根据属性来划分关系，分解为若干片段）

**定义：** 设R, R1, R2,…, Ri,…, Rn(1≤i≤n）为关系，

若满足如下条件：

1.    Attr(R1) Attr(R2)  Attr(Ri) …  Attr(Rn)=Attr(R)，其中Attr(R)表示R的属性集；

2.    {R1, R2,…, Ri,…, Rn}是R的无损分解；
3.    Attr(Ri)  Attr(Rj) =PK(R)，（i≠j, 1≤i≤n, 1≤j≤n ），其中PK(R)表示关系R的主码。则称{R1, R2,…, Ri,…, Rn}为关系R的垂直分片。

#### 混合分片：结合使用

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114150713366.png" alt="image-20231114150713366" style="zoom:40%;" />

#### 分片树：

-   **水平分片：**集合并操作
-   **垂直分片：**连接操作

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114150733266.png" alt="image-20231114150733266" style="zoom:33%;" />

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114233754547.png" alt="image-20231114233754547" style="zoom:33%;" />

#### 分布式查询处理

-   **查询优化**
-   **网络传输优化**

#### 查询处理示例

**SQL语句：**

```sql
select n_name, sum( l_extendedprice*(1-l_discount) ) as revenue from customer, orders, lineitem, supplier, nation, region //六表连接
Where c_custkey = o_custkey and l_orderkey = o_orderkey
and l_suppkey = s_suppkey and c_nationkey = s_nationkey
and s_nationkey = n_nationkey and n_regionkey = r_regionkey
and r_name = '[REGION]' //指定地区，在TPC-H标准指定的范围内随机选择
and o_orderdate >= date '[DATE]' //DATE是从1993年到1997年中随机选择的一年的1月1日
and o_orderdate < date '[DATE]' + interval '1' year
group by  n_name
order by revenue desc; //按收入降序排序
```

**查询图：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114152204746.png" alt="image-20231114152204746" style="zoom:40%;" />

**1. 查询分解：**等价变化优化查询树

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114152221269.png" alt="image-20231114152221269" style="zoom:50%;" />

**2. 数据局部化：**将关系用片段代替，将分布式查询映射为片段查询

片段查询树的生成步骤：

1.   先将分片树的水平节点转换成查询树的并U节点；

2.   再将分片树的垂直节点转换为查询树的连接⋈节点。

     <img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114152519895.png" alt="image-20231114152519895" style="zoom:40%;" />

-   1区域使用水平分片改写分片树

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114152831487.png" alt="image-20231114152831487" style="zoom:33%;" />

-   2区域根据参照分片，使用Hash分片到不同节点上

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114152920793.png" alt="image-20231114152920793" style="zoom:33%;" />

-   最后进行广播复制，聚合结果后进行归并

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114153024933.png" alt="image-20231114153024933" style="zoom:33%;" />

**3.查询存取优化：**将片段查询的关系代数表达式转换为可能的物理查询计划执行策略，主要优化连接操作

R与S连接，当S较小时，可以将S通过广播复制到R的每一个分片节点中进行本地连接再归并

**4. 局部查询优化：**

#### ==Semi-join半连接==

减少需要访问的元组总数量，降低网络通信开销

![Semi Join and Anti Join Should Have Their Own Syntax in SQL – Java, SQL and  jOOQ.](/Users/apple/Desktop/OnePerDay.github.io/assets/wiki-semi-join.png)

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114153547887.png" alt="image-20231114153547887" style="zoom:33%;" />

#### 查询优化技术

**不分区的哈希连接：**算法不适应硬件环境变化

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114154121157.png" alt="image-20231114154121157" style="zoom:33%;" />

**分区的哈希连接：**

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114154112121.png" alt="image-20231114154112121" style="zoom:33%;" />

#### ==Radix 哈希连接：算法适应硬件环境变化==

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/image-20231114154039980.png" alt="image-20231114154039980" style="zoom:33%;" />

### 面向其他数据类型的分布式查询处理实例

## [第九章：分布式事务]()

### 分布式提交算法

#### ==2PC提交==

#### 目的：保证分布式事务的原子性提交

#### 基本过程

1.   准备阶段
2.   提交阶段

#### 准备阶段

1.   协调者在本地记录Begin Commit并记录到REDO日志。
2.   协调者询问所有参与者是否可以执行提交操作（发起投票并等待所有参与者回复）。
3.   各参与者检查是否可以提交，或者执行子事务操作直到提交前，将undo和redo信息计入子事务日志中。若参与者认为可以提交，则将Ready记录到本地的REDO事务中。
4.   参与者回应协调者，同意提交则返回Vote Commit，进入就绪状态并等待协调者进一步消息；如果参与者本地失败，则返回Vore abort消息，并将Abort写入本地日志。

#### 提交阶段

如果协调者收到所有参与者Vote Commit：

1.   协调者将Commit写入本地日志
2.   协调者向所有参与者发出Global Commit 消息，进入commit状态
3.   参与者收到消息后，记录Commit消息到Redo日志，正式完成提交操作，释放资源。
4.   参与者向协调者发送Global End消息
5.   协调者收到所有参与者的Commit End消息，记录Commit End到本地REDO日志，完成事务。

如果协调者没有收到所有参与者的Vote Commit：

1.   协调者将Abort写入本地日志
2.   协调者向所有参与者发出Global Abort消息，进入abort状态
3.   参与者收到消息后，记录Abort消息到Redo日志，利用事务回滚机制执行回滚，释放资源。
4.   参与者向协调者发送Abort End消息
5.   协调者收到所有参与者的Abort End消息，事务完成，记录Abort End到本地REDO日志，

#### 缺点

**同步阻塞：**参与者等待其他参与者响应时事务是阻塞的

**单点故障：**如果协调者发生故障，参与者会一直阻塞，处于锁定事务资源状态

**数据不一致：**协调者向参与者发出commit请求时只有部分节点收到并提交，出现数据不一致

#### 改进

**同步阻塞：**增加超时机制

**单点故障：**增加切换协调者的动作

**数据不一致：**引入预提交阶段

#### ==3PC提交==

#### canCommit

协调者向参与者发送Commit请求，参与者如果可以提交就返回Vote Commit，否则返回Vote abort

#### preCommit

协调者根据参与者的回答与超时机制，判断是否能够进入下一阶段

-   如果收到的所有参与者的Vote Commit，协调者发出Global commit 的消息并进入下一阶段
-   如果收到Vote abort或者超时，协调者发出Global Abort 消息，参与者执行事务回滚。

#### doCommit

1.   进行真正的事务提交，配有超时机制
2.   协调者向所有参与者发出do Commit的请求，参与者收到后正式执行事务提交，释放事务资源
3.   参与者向协调者反馈完成的ack消息，协调者收到所有参与者的ack后完成事务提交。

#### 优点

1.   3PC在加入等待超时后协调者和参与者会中断事务，减少阻塞时间
2.   3PC解决协调者单点故障问题，doCommit过程中参与者会继续提交事务

## [第十章：故障恢复]()

### 分布式并发控制算法：

### ==Paxos算法：两阶段消息通讯==

#### 学习阶段

1.   proposer向acceptor发出提案，acceptor给出回复，
2.   如果proposer收到的回复数量超过半数的acceptor节点时进入第二阶段，并将第一阶段收到的所有回复中取时间编号最大的版本作为第二阶段提案的v值。

**两轮消息通讯：提议与回复**

在回复中acceptor可以将其他proposer发来的提案v值返回，proposer可能在第二轮中将该v值发送给acceptor

#### 接受阶段

1.   proposer向所有acceptor发出第一阶段选定的v值，
2.   acceptor节点通过收到的proposer发来的v的时间编号决定是否正式接受v值；当发来的时间编号大于或等于accpetor自身记录的最大时间编号时才会正式接受v值，否则拒绝。

<img src="/Users/apple/Desktop/OnePerDay.github.io/assets/paxos-diagram.png" alt="What is Paxos Consensus Algorithm? Definition & FAQs | ScyllaDB" style="zoom:50%;" />

[参考视频](https://www.youtube.com/watch?v=d7nAGI_NZPk)

### ==Raft算法==

#### 三种角色：Leader、Follower、Candidate

**Leader：** 决定v值取什么，通过广播同步日志（数据）

**Follower：**跟从者，接受并持久化Leader同步的日志

**Candidate：**Leader选举过程中进行临时参选

#### 算法流程

1.   将时间分成terms，每一个terms选举一个Leader，新Leader以广播的形式同步集群的shujugengxin
2.   如果Leader选举失败，该term会无事发生并继续推进

#### 观察

当多个结点尝试成为Leader时，或者多个结点认为自己是Leader时，实际上已经成为proposer。Raft算法本质上与Paxos算法相同

## 考试 && 实验

- 第二章：SQL for JSON
- 第三章：Redis
- 第四章：MongoDB
- 第五章：Neo4j



```
./neo4j-admin import --id-type=STRING --database=yelp 
--nodes=UserNode="../import/user_header.csv,../import/user.csv" 
--nodes=ReviewNode="../import/review_header.csv,../import/review.csv" 
--nodes=BusinessNode="../import/business_header.csv,../import/BusinessNode.csv" 
--nodes=CityNode="../import/city_header.csv,../import/CityNode.csv" 
--nodes=CategoryNode="../import/category_header.csv,../import/CategoryNode.csv" 
--relationships=HasFriend="../import/user_FRIENDS_user_header.csv,../import/user_FRIENDS_user.csv" 
--relationships=Review="../import/user_WROTE_review_header.csv,../import/user_WROTE_review.csv" 
--relationships=Reviewed="../import/review_REVIEWS_business_header.csv,../import/review_REVIEWS_business.csv" 
--relationships=IN_CITY="../import/business_IN_CITY_city_header.csv,../import/business_IN_CITY_city.csv" 
--relationships=IN_CATEGORY="../import/business_IN_CATEGORY_category_header.csv,../import/business_IN_CATEGORY_category.csv" --multiline-fields=true 
--skip-bad-relationships
```

